agam-robotics/NuttX/arch/arm/src/mcxa1xx/mcxa1xx_lpuart.c
#ifdef CONFIG_MCXA1XX_LPUART1
#define TTYS1_DEV           g_lpuart1priv /* LPUART1 is ttyS1 */
#endif

#ifdef CONFIG_MCXA1XX_LPUART2
#define TTYS2_DEV           g_lpuart2priv /* LPUART2 is ttyS2 */
#endif

#ifdef CONFIG_MCXA1XX_LPUART3
#define TTYS3_DEV           g_lpuart3priv /* LPUART3 is ttyS3 */
#endif

#ifdef CONFIG_MCXA1XX_LPUART4
#define TTYS4_DEV           g_lpuart4priv /* LPUART4 is ttyS4 */
#endif




/* Power management definitions */

#if defined(CONFIG_PM) && !defined(CONFIG_MCXA1XX_PM_SERIAL_ACTIVITY)
#  define CONFIG_MCXA1XX_PM_SERIAL_ACTIVITY 10
#endif

#if defined(CONFIG_PM)
#  define PM_IDLE_DOMAIN      0 /* Revisit */
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct mcxa1xx_uart_s
{
  struct uart_dev_s dev;     /* Generic UART device */

  const uint32_t uartbase;   /* Base address of UART registers */
  const int      uartnum;    /* LPUART number 1-8 */
  const bool     usects;     /* output flow control (CTS) available */
  const bool     userts;     /* input flow control (RTS) available */
  const bool     rs485mode;  /* We are in RS485 (RTS on TX) mode */
  const bool     inviflow;   /* Invert RTS sense */
  spinlock_t     lock;       /* Spinlock */
  uint32_t       baud;       /* Configured baud */
  uint32_t       ie;         /* Saved enabled interrupts */
  uint8_t        irq;        /* IRQ associated with this UART */
  uint8_t        parity;     /* 0=none, 1=odd, 2=even */
  uint8_t        bits;       /* Number of bits (7 or 8) */
  bool           stopbits2;  /* true: Configure with 2 stop bits vs 1 */
  bool           oflow;      /* output flow control (CTS) enabled */
  bool           iflow;      /* input flow control (RTS) enabled */

  /* TX DMA state */

#ifdef SERIAL_HAVE_TXDMA
  const unsigned int txch;   /* DMAMUX source of TX DMA request */
  DMACH_HANDLE       txdma;  /* currently-open transmit DMA stream */
#endif

  /* RX DMA state */

#ifdef SERIAL_HAVE_RXDMA
  const unsigned int rxch;          /* DMAMUX source of RX DMA request */
  DMACH_HANDLE       rxdma;         /* currently-open receive DMA stream */
  bool               rxenable;      /* DMA-based reception en/disable */
  uint32_t           rxdmanext;     /* Next byte in the DMA buffer to be read */
#ifndef CONFIG_ARM64_DCACHE_DISABLE
  uint32_t           rxdmaavail;    /* Number of bytes available without need to
                                     * to invalidate the data cache */
#endif
  char *const        rxfifo;        /* Receive DMA buffer */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static inline uint32_t mcxa1xx_serialin(struct mcxa1xx_uart_s *priv,
                                      uint32_t offset);
static inline void mcxa1xx_serialout(struct mcxa1xx_uart_s *priv,
                                   uint32_t offset, uint32_t value);
static inline void mcxa1xx_disableuartint(struct mcxa1xx_uart_s *priv,
                                        uint32_t *ie);
static inline void mcxa1xx_restoreuartint(struct mcxa1xx_uart_s *priv,
                                        uint32_t ie);

static int  mcxa1xx_setup(struct uart_dev_s *dev);
static void mcxa1xx_shutdown(struct uart_dev_s *dev);
static int  mcxa1xx_attach(struct uart_dev_s *dev);
static void mcxa1xx_detach(struct uart_dev_s *dev);
static int  mcxa1xx_interrupt(int irq, void *context, void *arg);
static int  mcxa1xx_ioctl(struct file *filep, int cmd, unsigned long arg);
#if !defined(SERIAL_HAVE_ONLY_RXDMA)
static int  mcxa1xx_receive(struct uart_dev_s *dev, unsigned int *status);
static void mcxa1xx_rxint(struct uart_dev_s *dev, bool enable);
static bool mcxa1xx_rxavailable(struct uart_dev_s *dev);
#endif
#if !defined(SERIAL_HAVE_ONLY_TXDMA)
static void mcxa1xx_txint(struct uart_dev_s *dev, bool enable);
#endif

static void mcxa1xx_send(struct uart_dev_s *dev, int ch);

static bool mcxa1xx_txready(struct uart_dev_s *dev);

#ifdef SERIAL_HAVE_TXDMA
static void mcxa1xx_dma_send(struct uart_dev_s *dev);
static void mcxa1xx_dma_txint(struct uart_dev_s *dev, bool enable);
static void mcxa1xx_dma_txavailable(struct uart_dev_s *dev);
static void mcxa1xx_dma_txcallback(DMACH_HANDLE handle, void *arg, bool done,
                                   int result);
#endif

#if defined(SERIAL_HAVE_RXDMA) || defined(SERIAL_HAVE_TXDMA)
static int  mcxa1xx_dma_setup(struct uart_dev_s *dev);
static void mcxa1xx_dma_shutdown(struct uart_dev_s *dev);
#endif

#ifdef SERIAL_HAVE_RXDMA
static int  mcxa1xx_dma_receive(struct uart_dev_s *dev,
                                unsigned int *status);
#ifdef CONFIG_PM
static void mcxa1xx_dma_reenable(struct mcxa1xx_uart_s *priv);
#endif
static void mcxa1xx_dma_rxint(struct uart_dev_s *dev, bool enable);
static bool mcxa1xx_dma_rxavailable(struct uart_dev_s *dev);

static void mcxa1xx_dma_rxcallback(DMACH_HANDLE handle, void *arg, bool done,
                                   int result);
#endif

static bool mcxa1xx_txempty(struct uart_dev_s *dev);

#ifdef CONFIG_PM
static void up_pm_notify(struct pm_callback_s *cb, int dowmin,
                         enum pm_state_e pmstate);
static int  up_pm_prepare(struct pm_callback_s *cb, int domain,
                          enum pm_state_e pmstate);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Serial driver UART operations */

#if !defined(SERIAL_HAVE_ONLY_TXDMA) && !defined(SERIAL_HAVE_ONLY_RXDMA)
static const struct uart_ops_s g_lpuart_ops =
{
  .setup          = mcxa1xx_setup,
  .shutdown       = mcxa1xx_shutdown,
  .attach         = mcxa1xx_attach,
  .detach         = mcxa1xx_detach,
  .ioctl          = mcxa1xx_ioctl,
  .receive        = mcxa1xx_receive,
  .rxint          = mcxa1xx_rxint,
  .rxavailable    = mcxa1xx_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = NULL,
#endif
  .send           = mcxa1xx_send,
  .txint          = mcxa1xx_txint,
  .txready        = mcxa1xx_txready,
  .txempty        = mcxa1xx_txempty,
};
#endif

#if defined(SERIAL_HAVE_RXDMA) && defined(SERIAL_HAVE_TXDMA)
static const struct uart_ops_s g_lpuart_rxtxdma_ops =
{
  .setup          = mcxa1xx_dma_setup,
  .shutdown       = mcxa1xx_dma_shutdown,
  .attach         = mcxa1xx_attach,
  .detach         = mcxa1xx_detach,
  .ioctl          = mcxa1xx_ioctl,
  .receive        = mcxa1xx_dma_receive,
  .rxint          = mcxa1xx_dma_rxint,
  .rxavailable    = mcxa1xx_dma_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = NULL,
#endif
  .send           = mcxa1xx_send,
  .txint          = mcxa1xx_dma_txint,
  .txready        = mcxa1xx_txready,
  .txempty        = mcxa1xx_txempty,
  .dmatxavail     = mcxa1xx_dma_txavailable,
  .dmasend        = mcxa1xx_dma_send,
};
#endif

