agam-robotics/NuttX/arch/arm/src/mcxa1xx/mcxa1xx_lpuart.c
#if !defined(SERIAL_HAVE_ONLY_DMA) && defined(SERIAL_HAVE_RXDMA)
static const struct uart_ops_s g_lpuart_rxdma_ops =
{
  .setup          = mcxa1xx_dma_setup,
  .shutdown       = mcxa1xx_dma_shutdown,
  .attach         = mcxa1xx_attach,
  .detach         = mcxa1xx_detach,
  .ioctl          = mcxa1xx_ioctl,
  .receive        = mcxa1xx_dma_receive,
  .rxint          = mcxa1xx_dma_rxint,
  .rxavailable    = mcxa1xx_dma_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = NULL,
#endif
  .send           = mcxa1xx_send,
  .txint          = mcxa1xx_txint,
  .txready        = mcxa1xx_txready,
  .txempty        = mcxa1xx_txempty,
};
#endif

#if !defined(SERIAL_HAVE_ONLY_DMA) && defined(SERIAL_HAVE_TXDMA)
static const struct uart_ops_s g_lpuart_txdma_ops =
{
    .setup          = mcxa1xx_dma_setup,
    .shutdown       = mcxa1xx_dma_shutdown,
    .attach         = mcxa1xx_attach,
    .detach         = mcxa1xx_detach,
    .ioctl          = mcxa1xx_ioctl,
    .receive        = mcxa1xx_receive,
    .rxint          = mcxa1xx_rxint,
    .rxavailable    = mcxa1xx_rxavailable,
  #ifdef CONFIG_SERIAL_IFLOWCONTROL
    .rxflowcontrol  = NULL,
  #endif
    .send           = mcxa1xx_send,
    .txint          = mcxa1xx_dma_txint,
    .txready        = mcxa1xx_txready,
    .txempty        = mcxa1xx_txempty,
    .dmatxavail     = mcxa1xx_dma_txavailable,
    .dmasend        = mcxa1xx_dma_send,
};
#endif

/* Avoid unused warning */
#if !defined(SERIAL_HAVE_ONLY_DMA) && defined(SERIAL_HAVE_RXDMA)
const struct uart_ops_s *g_o0 = &g_lpuart_rxdma_ops;
#endif
#if !defined(SERIAL_HAVE_ONLY_DMA) && defined(SERIAL_HAVE_TXDMA)
const struct uart_ops_s *g_o1 = &g_lpuart_txdma_ops;
#endif

/* I/O buffers */

#ifdef CONFIG_LPUART0_RXDMA
static char g_lpuart0rxfifo[RXDMA_BUFFER_SIZE]
  aligned_data(DMA_ALIGNMENT);
#endif

#ifdef CONFIG_LPUART1_RXDMA
static char g_lpuart1rxfifo[RXDMA_BUFFER_SIZE]
  aligned_data(DMA_ALIGNMENT);
#endif

# ifdef CONFIG_LPUART2_RXDMA
static char g_lpuart2rxfifo[RXDMA_BUFFER_SIZE]
  aligned_data(DMA_ALIGNMENT);
#endif

#ifdef CONFIG_LPUART3_RXDMA
static char g_lpuart3rxfifo[RXDMA_BUFFER_SIZE]
  aligned_data(DMA_ALIGNMENT);
#endif

#ifdef CONFIG_LPUART4_RXDMA
static char g_lpuart4rxfifo[RXDMA_BUFFER_SIZE]
  aligned_data(DMA_ALIGNMENT);
#endif

#ifdef CONFIG_MCXA1XX_LPUART0
static char g_lpuart0rxbuffer[CONFIG_LPUART0_RXBUFSIZE];
static char g_lpuart0txbuffer[LPUART0_TXBUFSIZE_ADJUSTED] \
  LPUART0_TXBUFSIZE_ALGN;
#endif

#ifdef CONFIG_MCXA1XX_LPUART1
static char g_lpuart1rxbuffer[CONFIG_LPUART1_RXBUFSIZE];
static char g_lpuart1txbuffer[LPUART1_TXBUFSIZE_ADJUSTED]
  LPUART1_TXBUFSIZE_ALGN;
#endif

#ifdef CONFIG_MCXA1XX_LPUART2
static char g_lpuart2rxbuffer[CONFIG_LPUART2_RXBUFSIZE];
static char g_lpuart2txbuffer[LPUART2_TXBUFSIZE_ADJUSTED]
  LPUART2_TXBUFSIZE_ALGN;
#endif

#ifdef CONFIG_MCXA1XX_LPUART3
static char g_lpuart3rxbuffer[CONFIG_LPUART3_RXBUFSIZE];
static char g_lpuart3txbuffer[LPUART3_TXBUFSIZE_ADJUSTED]
  LPUART3_TXBUFSIZE_ALGN;
#endif

#ifdef CONFIG_MCXA1XX_LPUART4
static char g_lpuart4rxbuffer[CONFIG_LPUART4_RXBUFSIZE];
static char g_lpuart4txbuffer[LPUART4_TXBUFSIZE_ADJUSTED]
  LPUART4_TXBUFSIZE_ALGN;
#endif




#ifdef CONFIG_MCXA1XX_LPUART0
static struct mcxa1xx_uart_s g_lpuart0priv =
{
  .dev =
    {
      .recv     =
      {
        .size   = CONFIG_LPUART0_RXBUFSIZE,
        .buffer = g_lpuart0rxbuffer,
      },
      .xmit     =
      {
        .size   = CONFIG_LPUART0_TXBUFSIZE,
        .buffer = g_lpuart0txbuffer,
      },
    #if defined(CONFIG_LPUART0_RXDMA) && defined(CONFIG_LPUART0_TXDMA)
        .ops    = &g_lpuart_rxtxdma_ops,
    #elif defined(CONFIG_LPUART0_RXDMA) && !defined(CONFIG_LPUART0_TXDMA)
        .ops    = &g_lpuart_rxdma_ops,
    #elif !defined(CONFIG_LPUART0_RXDMA) && defined(CONFIG_LPUART0_TXDMA)
        .ops    = &g_lpuart_txdma_ops,
    #else
        .ops    = &g_lpuart_ops,
    #endif
    },

  .uartbase     = MCXA1XX_LPUART0_BASE,
  .uartnum      = 0,
  .baud         = CONFIG_LPUART0_BAUD,
  .irq          = MCXA156_IRQ_LPUART0,
  .parity       = CONFIG_LPUART0_PARITY,
  .bits         = CONFIG_LPUART0_BITS,
  .lock         = SP_UNLOCKED,
  .stopbits2    = CONFIG_LPUART0_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART0_OFLOWCONTROL)
  .usects       = true,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART0_IFLOWCONTROL)
  .userts       = true,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART0_INVERTIFLOWCONTROL)
  .inviflow     = true,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART0_RS485RTSCONTROL)
  .rs485mode    = true,
#  endif

#  ifdef CONFIG_LPUART0_TXDMA
  .txch = DMA_REQUEST_MUXLPUART0TX,
#  endif
#  ifdef CONFIG_LPUART0_RXDMA
  .rxch = DMA_REQUEST_MUXLPUART0RX,
  .rxfifo       = g_lpuart0rxfifo,
#  endif
};
#endif

#ifdef CONFIG_MCXA1XX_LPUART1
static struct mcxa1xx_uart_s g_lpuart1priv =
{
  .dev =
    {
      .recv     =
      {
        .size   = CONFIG_LPUART1_RXBUFSIZE,
        .buffer = g_lpuart1rxbuffer,
      },
      .xmit     =
      {
        .size   = CONFIG_LPUART1_TXBUFSIZE,
        .buffer = g_lpuart1txbuffer,
      },
#  if defined(CONFIG_LPUART1_RXDMA) && defined(CONFIG_LPUART1_TXDMA)
        .ops    = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART1_RXDMA) && !defined(CONFIG_LPUART1_TXDMA)
        .ops    = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART1_RXDMA) && defined(CONFIG_LPUART1_TXDMA)
        .ops    = &g_lpuart_txdma_ops,
#  else
        .ops    = &g_lpuart_ops,
#  endif
    },

  .uartbase     = MCXA1XX_LPUART1_BASE,
  .uartnum      = 1,
  .baud         = CONFIG_LPUART1_BAUD,
  .irq          = MCXA156_IRQ_LPUART1,
  .parity       = CONFIG_LPUART1_PARITY,
  .bits         = CONFIG_LPUART1_BITS,
  .lock         = SP_UNLOCKED,
  .stopbits2    = CONFIG_LPUART1_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART1_OFLOWCONTROL)
  .usects       = true,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART1_IFLOWCONTROL)
  .userts       = true,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART1_INVERTIFLOWCONTROL)
  .inviflow     = true,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART1_RS485RTSCONTROL)
  .rs485mode    = true,
#  endif

#  ifdef CONFIG_LPUART1_TXDMA
  .txch = DMA_REQUEST_MUXLPUART1TX,
#  endif
#  ifdef CONFIG_LPUART1_RXDMA
  .rxch = DMA_REQUEST_MUXLPUART1RX,
  .rxfifo       = g_lpuart1rxfifo,
#  endif
};
#endif

#ifdef CONFIG_MCXA1XX_LPUART2
static struct mcxa1xx_uart_s g_lpuart2priv =
{
  .dev =
    {
      .recv     =
      {
        .size   = CONFIG_LPUART2_RXBUFSIZE,
        .buffer = g_lpuart2rxbuffer,
      },
      .xmit     =
      {
        .size   = CONFIG_LPUART2_TXBUFSIZE,
        .buffer = g_lpuart2txbuffer,
      },
#  if defined(CONFIG_LPUART2_RXDMA) && defined(CONFIG_LPUART2_TXDMA)
        .ops    = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART2_RXDMA) && !defined(CONFIG_LPUART2_TXDMA)
        .ops    = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART2_RXDMA) && defined(CONFIG_LPUART2_TXDMA)
        .ops    = &g_lpuart_txdma_ops,
#  else
        .ops    = &g_lpuart_ops,
#  endif
    },

  .uartbase     = MCXA1XX_LPUART2_BASE,
  .uartnum      = 2,
  .baud         = CONFIG_LPUART2_BAUD,
  .irq          = MCXA156_IRQ_LPUART2,
  .parity       = CONFIG_LPUART2_PARITY,
  .bits         = CONFIG_LPUART2_BITS,
  .lock         = SP_UNLOCKED,
  .stopbits2    = CONFIG_LPUART2_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART2_OFLOWCONTROL)
  .usects       = true,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART2_IFLOWCONTROL)
  .userts       = true,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART2_INVERTIFLOWCONTROL)
  .inviflow     = true,
#  endif

