agam-robotics/NuttX/arch/arm/src/mcxa1xx/mcxa1xx_lpuart.c
#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART2_RS485RTSCONTROL)
  .rs485mode    = true,
#  endif

#  ifdef CONFIG_LPUART2_TXDMA
  .txch = DMA_REQUEST_MUXLPUART2TX,
#  endif
#  ifdef CONFIG_LPUART2_RXDMA
  .rxch = DMA_REQUEST_MUXLPUART2RX,
  .rxfifo       = g_lpuart2rxfifo,
#  endif
};
#endif

#ifdef CONFIG_MCXA1XX_LPUART3
static struct mcxa1xx_uart_s g_lpuart3priv =
{
  .dev =
    {
      .recv     =
      {
        .size   = CONFIG_LPUART3_RXBUFSIZE,
        .buffer = g_lpuart3rxbuffer,
      },
      .xmit     =
      {
        .size   = CONFIG_LPUART3_TXBUFSIZE,
        .buffer = g_lpuart3txbuffer,
      },
#  if defined(CONFIG_LPUART3_RXDMA) && defined(CONFIG_LPUART3_TXDMA)
        .ops    = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART3_RXDMA) && !defined(CONFIG_LPUART3_TXDMA)
        .ops    = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART3_RXDMA) && defined(CONFIG_LPUART3_TXDMA)
        .ops    = &g_lpuart_txdma_ops,
#  else
        .ops    = &g_lpuart_ops,
#  endif
    },

  .uartbase     = MCXA1XX_LPUART3_BASE,
  .uartnum      = 3,
  .baud         = CONFIG_LPUART3_BAUD,
  .irq          = MCXA156_IRQ_LPUART3,
  .parity       = CONFIG_LPUART3_PARITY,
  .bits         = CONFIG_LPUART3_BITS,
  .lock         = SP_UNLOCKED,
  .stopbits2    = CONFIG_LPUART3_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART3_OFLOWCONTROL)
  .usects       = true,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART3_IFLOWCONTROL)
  .userts       = true,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART3_INVERTIFLOWCONTROL)
  .inviflow     = true,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART3_RS485RTSCONTROL)
  .rs485mode    = true,
#  endif

#  ifdef CONFIG_LPUART3_TXDMA
  .txch = DMA_REQUEST_MUXLPUART3TX,
#  endif
#  ifdef CONFIG_LPUART3_RXDMA
  .rxch = DMA_REQUEST_MUXLPUART3RX,
  .rxfifo       = g_lpuart3rxfifo,
#  endif
};
#endif

#ifdef CONFIG_MCXA1XX_LPUART4
static struct mcxa1xx_uart_s g_lpuart4priv =
{
  .dev =
    {
      .recv     =
      {
        .size   = CONFIG_LPUART4_RXBUFSIZE,
        .buffer = g_lpuart4rxbuffer,
      },
      .xmit     =
      {
        .size   = CONFIG_LPUART4_TXBUFSIZE,
        .buffer = g_lpuart4txbuffer,
      },
#  if defined(CONFIG_LPUART4_RXDMA) && defined(CONFIG_LPUART4_TXDMA)
        .ops    = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART4_RXDMA) && !defined(CONFIG_LPUART4_TXDMA)
        .ops    = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART4_RXDMA) && defined(CONFIG_LPUART4_TXDMA)
        .ops    = &g_lpuart_txdma_ops,
#  else
        .ops    = &g_lpuart_ops,
#  endif
    },

  .uartbase     = MCXA1XX_LPUART4_BASE,
  .uartnum      = 4,
  .baud         = CONFIG_LPUART4_BAUD,
  .irq          = MCXA156_IRQ_LPUART4,
  .parity       = CONFIG_LPUART4_PARITY,
  .bits         = CONFIG_LPUART4_BITS,
  .lock         = SP_UNLOCKED,
  .stopbits2    = CONFIG_LPUART4_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART4_OFLOWCONTROL)
  .usects       = true,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART4_IFLOWCONTROL)
  .userts       = true,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART4_INVERTIFLOWCONTROL)
  .inviflow     = true,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART4_RS485RTSCONTROL)
  .rs485mode    = true,
#  endif

#  ifdef CONFIG_LPUART4_TXDMA
  .txch = DMA_REQUEST_MUXLPUART4TX,
#  endif
#  ifdef CONFIG_LPUART4_RXDMA
  .rxch = DMA_REQUEST_MUXLPUART4RX,
  .rxfifo       = g_lpuart4rxfifo,
#  endif
};
#endif




#ifdef CONFIG_PM
static  struct pm_callback_s g_serial_pmcb =
{
  .notify       = up_pm_notify,
  .prepare      = up_pm_prepare,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: mcxa1xx_serialin
 ****************************************************************************/

static inline uint32_t mcxa1xx_serialin(struct mcxa1xx_uart_s *priv,
                                      uint32_t offset)
{
  return getreg32(priv->uartbase + offset);
}

/****************************************************************************
 * Name: mcxa1xx_serialout
 ****************************************************************************/

static inline void mcxa1xx_serialout(struct mcxa1xx_uart_s *priv,
                                     uint32_t offset, uint32_t value)
{
  putreg32(value, priv->uartbase + offset);
}

/****************************************************************************
 * Name: mcxa1xx_dma_nextrx
 *
 * Description:
 *   Returns the index into the RX FIFO where the DMA will place the next
 *   byte that it receives.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static int mcxa1xx_dma_nextrx(struct mcxa1xx_uart_s *priv)
{
  int dmaresidual = mcxa1xx_dmach_getcount(priv->rxdma);
  DEBUGASSERT(dmaresidual <= RXDMA_BUFFER_SIZE);

  return (RXDMA_BUFFER_SIZE - dmaresidual) % RXDMA_BUFFER_SIZE;
}
#endif

/****************************************************************************
 * Name: mcxa1xx_disableuartint
 ****************************************************************************/

static inline void mcxa1xx_disableuartint_nolock(struct mcxa1xx_uart_s *priv,
                                              uint32_t *ie)
{
  uint32_t regval;

  regval = mcxa1xx_serialin(priv, MCXA1XX_LPUART_CTRL_OFFSET);

  /* Return the current Rx and Tx interrupt state */

  if (ie != NULL)
    {
      *ie = regval & LPUART_ALL_INTS;
    }

  regval &= ~LPUART_ALL_INTS;
  mcxa1xx_serialout(priv, MCXA1XX_LPUART_CTRL_OFFSET, regval);
}

static inline void mcxa1xx_disableuartint(struct mcxa1xx_uart_s *priv,
                                       uint32_t *ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);
  mcxa1xx_disableuartint_nolock(priv, ie);
  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: mcxa1xx_restoreuartint
 ****************************************************************************/

