agam-robotics/NuttX/arch/arm/src/mcxa1xx/mcxa1xx_lpuart.c
static inline void mcxa1xx_restoreuartint_nolock(struct mcxa1xx_uart_s *priv,
                                              uint32_t ie)
{
  uint32_t regval;

  regval  = mcxa1xx_serialin(priv, MCXA1XX_LPUART_CTRL_OFFSET);
  regval &= ~LPUART_ALL_INTS;
  regval |= ie;
  mcxa1xx_serialout(priv, MCXA1XX_LPUART_CTRL_OFFSET, regval);
}

static inline void mcxa1xx_restoreuartint(struct mcxa1xx_uart_s *priv,
                                       uint32_t ie)
{
  irqstate_t flags;

  /* Enable/disable any interrupts that are currently disabled but should be
   * enabled/disabled.
   */

  flags = spin_lock_irqsave(&priv->lock);
  mcxa1xx_restoreuartint_nolock(priv, ie);
  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: mcxa1xx_dma_setup
 *
 * Description:
 *   Configure the LPUART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

#if defined(SERIAL_HAVE_RXDMA) || defined(SERIAL_HAVE_TXDMA)
static int mcxa1xx_dma_setup(struct uart_dev_s *dev)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;
#if defined(SERIAL_HAVE_RXDMA)
  struct mcxa1xx_edma_xfrconfig_s config;
#endif
  int result;

  /* Do the basic UART setup first, unless we are the console */

  if (!dev->isconsole)
    {
      result = mcxa1xx_setup(dev);
      if (result != OK)
        {
          return result;
        }
    }

#if defined(SERIAL_HAVE_TXDMA)
  /* Acquire the Tx DMA channel.  This should always succeed. */

  if (priv->txch != 0)
    {
      if (priv->txdma == NULL)
        {
          priv->txdma = mcxa1xx_dmach_alloc(priv->txch, 0);
          if (priv->txdma == NULL)
            {
              return -EBUSY;
            }
        }

      /* Enable Tx DMA for the UART */

      modifyreg32(priv->uartbase + MCXA1XX_LPUART_BAUD_OFFSET,
                  0, LPUART_BAUD_TDMAE);
    }
#endif

#if defined(SERIAL_HAVE_RXDMA)
  /* Acquire the Rx DMA channel.  This should always succeed. */

  if (priv->rxch != 0)
    {
      if (priv->rxdma == NULL)
        {
          priv->rxdma = mcxa1xx_dmach_alloc(priv->rxch, 0);

          if (priv->rxdma == NULL)
            {
              return -EBUSY;
            }
        }
      else
        {
          mcxa1xx_dmach_stop(priv->rxdma);
        }

      /* Configure for circular DMA reception into the RX FIFO */

      config.saddr  = priv->uartbase + MCXA1XX_LPUART_DATA_OFFSET;
      config.daddr  = (uintptr_t)priv->rxfifo;
      config.soff   = 0;
      config.doff   = 1;
      config.iter   = RXDMA_BUFFER_SIZE;
      config.flags  = EDMA_CONFIG_LINKTYPE_LINKNONE |
                      EDMA_CONFIG_LOOPDEST |
                      EDMA_CONFIG_INTHALF  |
                      EDMA_CONFIG_INTMAJOR;
      config.ssize  = EDMA_8BIT;
      config.dsize  = EDMA_8BIT;
      config.nbytes = 1;
#ifdef CONFIG_MCXA1XX_EDMA_ELINK
      config.linkch = 0;
#endif

      mcxa1xx_dmach_xfrsetup(priv->rxdma , &config);

      /* Reset our DMA shadow pointer and Rx data availability count to
       * match the address just programmed above.
       */

      priv->rxdmanext = 0;

#ifndef CONFIG_ARM64_DCACHE_DISABLE

      /* Make sure the rx buffer area is all invalid or clean */

      up_invalidate_dcache((uintptr_t)priv->rxfifo,
                           (uintptr_t)priv->rxfifo + RXDMA_BUFFER_SIZE);
      priv->rxdmaavail = 0;
#endif

      /* Enable receive Rx DMA for the UART */

      modifyreg32(priv->uartbase + MCXA1XX_LPUART_BAUD_OFFSET,
                  0, LPUART_BAUD_RDMAE);

      /* Enable interrupt on idle and errors */

      modifyreg32(priv->uartbase + MCXA1XX_LPUART_CTRL_OFFSET, 0,
                  LPUART_CTRL_PEIE       |
                  LPUART_CTRL_FEIE       |
                  LPUART_CTRL_NEIE       |
                  LPUART_CTRL_ILIE);

      /* Start the DMA channel, and arrange for callbacks at the half and
       * full points in the FIFO.  This ensures that we have half a FIFO
       * worth of time to claim bytes before they are overwritten.
       */

      mcxa1xx_dmach_start(priv->rxdma, mcxa1xx_dma_rxcallback, (void *)priv);
    }
#endif

  return OK;
}
#endif

/****************************************************************************
 * Name: mcxa1xx_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, fifos, etc. This
 *   method is called the first time that the serial priv is
 *   opened.
 *
 ****************************************************************************/

static int mcxa1xx_setup(struct uart_dev_s *dev)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;
#ifndef CONFIG_SUPPRESS_LPUART_CONFIG
  struct uart_config_s config;
  int ret;

  /* Configure the UART */

  memset(&config, 0, sizeof(config));
  config.baud       = priv->baud;       /* Configured baud */
  config.parity     = priv->parity;     /* 0=none, 1=odd, 2=even */
  config.bits       = priv->bits;       /* Number of bits (5-9) */
  config.stopbits2  = priv->stopbits2;  /* true: Configure with 2 stop bits instead of 1 */

  config.users485   = priv->rs485mode;  /* Switch into RS485 mode */
  config.userts     = priv->iflow;
  config.invrts     = priv->inviflow;   /* Inversion of outbound flow control */
  config.usects     = priv->oflow;

  ret = mcxa1xx_lpuart_configure(priv->uartbase, priv->uartnum, &config);

  priv->ie = mcxa1xx_serialin(priv, MCXA1XX_LPUART_CTRL_OFFSET) & \
             LPUART_ALL_INTS;
  return ret;

#else
  priv->ie = mcxa1xx_serialin(priv, MCXA1XX_LPUART_CTRL_OFFSET) & \
             LPUART_ALL_INTS;
  return OK;
#endif
}

/****************************************************************************
 * Name: mcxa1xx_shutdown
 *
 * Description:
 *   Disable the UART.  This method is called when the serial
 *   priv is closed
 *
 ****************************************************************************/

static void mcxa1xx_shutdown(struct uart_dev_s *dev)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;

