agam-robotics/NuttX/arch/arm/src/mcxa1xx/mcxa1xx_lpuart.c
  /* Disable the UART */

  mcxa1xx_serialout(priv, MCXA1XX_LPUART_GLOBAL_OFFSET, LPUART_GLOBAL_RST);
}

/****************************************************************************
 * Name: mcxa1xx_dma_shutdown
 *
 * Description:
 *   Disable the LPUART.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

#if defined(SERIAL_HAVE_RXDMA) || defined(SERIAL_HAVE_TXDMA)
static void mcxa1xx_dma_shutdown(struct uart_dev_s *dev)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;

  /* Perform the normal UART shutdown */

  mcxa1xx_shutdown(dev);

#if defined(SERIAL_HAVE_RXDMA)
  /* Stop the RX DMA channel */

  if (priv->rxch != 0)
    {
      mcxa1xx_dmach_stop(priv->rxdma);

      /* Release the RX DMA channel */

      mcxa1xx_dmach_free(priv->rxdma);
      priv->rxdma = NULL;
    }
#endif

#if defined(SERIAL_HAVE_TXDMA)
  /* Stop the TX DMA channel */

  if (priv->txch != 0)
    {
      mcxa1xx_dmach_stop(priv->txdma);

      /* Release the TX DMA channel */

      mcxa1xx_dmach_free(priv->txdma);
      priv->txdma = NULL;
    }
#endif
}
#endif

/****************************************************************************
 * Name: mcxa1xx_attach
 *
 * Description:
 *   Configure the UART to operation in interrupt driven mode.  This method
 *   is called when the serial priv is opened.  Normally, this is just after
 *   the setup() method is called, however, the serial console may operate
 *   in a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless
 *   the hardware supprivs multiple levels of interrupt enabling).  The RX
 *   and TX interrupts are not enabled until the txint() and rxint() methods
 *   are called.
 *
 ****************************************************************************/

static int mcxa1xx_attach(struct uart_dev_s *dev)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;
  int ret;

  /* Attach and enable the IRQ */

  ret = irq_attach(priv->irq, mcxa1xx_interrupt, dev);
  if (ret == OK)
    {
      /* Enable the interrupt (RX and TX interrupts are still disabled
       * in the UART
       */

      up_enable_irq(priv->irq);
    }

  return ret;
}

/****************************************************************************
 * Name: mcxa1xx_detach
 *
 * Description:
 *   Detach UART interrupts.  This method is called when the serial priv is
 *   closed normally just before the shutdown method is called.  The
 *   exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void mcxa1xx_detach(struct uart_dev_s *dev)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;

  up_disable_irq(priv->irq);
  irq_detach(priv->irq);
}

/****************************************************************************
 * Name: mcxa1xx_interrupt (and front-ends)
 *
 * Description:
 *   This is the common UART interrupt handler.  It will be invoked when an
 *   interrupt is received on the 'irq'.  It should call uart_xmitchars or
 *   uart_recvchars to perform the appropriate data transfers.  The
 *   interrupt handling logic must be able to map the 'arg' to the
 *   appropriate uart_dev_s structure in order to call these functions.
 *
 ****************************************************************************/

static int mcxa1xx_interrupt(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  struct mcxa1xx_uart_s *priv;
  uint32_t usr;
  uint32_t lsr;

  DEBUGASSERT(dev != NULL && dev != NULL);
  priv = (struct mcxa1xx_uart_s *)dev;

#if defined(CONFIG_PM) && CONFIG_MCXA1XX_PM_SERIAL_ACTIVITY > 0
  /* Repriv serial activity to the power management logic */

  pm_activity(PM_IDLE_DOMAIN, CONFIG_MCXA1XX_PM_SERIAL_ACTIVITY);
#endif

  /* Get the current UART status and check for loop
   * termination conditions
   */

  usr  = mcxa1xx_serialin(priv, MCXA1XX_LPUART_STAT_OFFSET);

  /* Removed all W1C from the last sr */

  lsr  = usr & ~(LPUART_STAT_LBKDIF | LPUART_STAT_RXEDGIF |
                 LPUART_STAT_IDLE   | LPUART_STAT_OR      |
                 LPUART_STAT_NF     | LPUART_STAT_FE      |
                 LPUART_STAT_PF     | LPUART_STAT_MA1F    |
                 LPUART_STAT_MA2F);

  /* Keep what we will service */

  usr &= (LPUART_STAT_RDRF | LPUART_STAT_TDRE | LPUART_STAT_OR |
          LPUART_STAT_FE | LPUART_STAT_NF | LPUART_STAT_PF |
          LPUART_STAT_IDLE);

  /* Clear serial overrun, parity and framing errors */

  if ((usr & LPUART_STAT_OR) != 0)
    {
      mcxa1xx_serialout(priv, MCXA1XX_LPUART_STAT_OFFSET,
                     LPUART_STAT_OR | lsr);
    }

  if ((usr & LPUART_STAT_NF) != 0)
    {
      mcxa1xx_serialout(priv, MCXA1XX_LPUART_STAT_OFFSET,
                     LPUART_STAT_NF | lsr);
    }

  if ((usr & LPUART_STAT_PF) != 0)
    {
      mcxa1xx_serialout(priv, MCXA1XX_LPUART_STAT_OFFSET,
                     LPUART_STAT_PF | lsr);
    }

  if ((usr & LPUART_STAT_FE) != 0)
    {
      mcxa1xx_serialout(priv, MCXA1XX_LPUART_STAT_OFFSET,
                     LPUART_STAT_FE | lsr);
    }

  if ((usr & (LPUART_STAT_FE | LPUART_STAT_PF | LPUART_STAT_NF)) != 0)
    {
      /* Discard data */

      mcxa1xx_serialin(priv, MCXA1XX_LPUART_DATA_OFFSET);
    }

#ifdef SERIAL_HAVE_RXDMA
  /* The line going to idle, deliver any fractions of RX data */

  if ((usr & LPUART_STAT_IDLE) != 0)
    {
      mcxa1xx_serialout(priv, MCXA1XX_LPUART_STAT_OFFSET,
                     LPUART_STAT_IDLE | lsr);
      mcxa1xx_dma_rxcallback(priv->rxdma, priv, false, LPUART_STAT_IDLE);
    }
#endif

  /* Handle incoming, receive bytes */

  if ((priv->ie & LPUART_CTRL_RIE) != 0 && mcxa1xx_rxavailable(&priv->dev))
    {
      uart_recvchars(dev);
    }

  /* Handle outgoing, transmit bytes */

  if ((priv->ie & LPUART_CTRL_TIE) != 0)
    {
      uart_xmitchars(dev);
    }

  return OK;
}

/****************************************************************************
 * Name: mcxa1xx_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int mcxa1xx_ioctl(struct file *filep, int cmd, unsigned long arg)
{
#if defined(CONFIG_SERIAL_TIOCSERGSTRUCT)   || \
    defined(CONFIG_SERIAL_TERMIOS)          || \
    defined(CONFIG_MCXA1XX_LPUART_SINGLEWIRE ) || \
    defined(CONFIG_MCXA1XX_LPUART_INVERT )
  struct inode *inode = filep->f_inode;
  struct uart_dev_s *dev = inode->i_private;
  irqstate_t flags;
#endif
  int ret   = OK;

