agam-robotics/NuttX/arch/arm/src/mcxa1xx/mcxa1xx_lpuart.c
  /* Reset our DMA shadow pointer and Rx data availability count to match
   * the address just programmed above.
   */

  priv->rxdmanext = 0;
#ifndef CONFIG_ARM64_DCACHE_DISABLE
  priv->rxdmaavail = 0;
#endif

  /* Start the DMA channel, and arrange for callbacks at the half and
   * full points in the FIFO.  This ensures that we have half a FIFO
   * worth of time to claim bytes before they are overwritten.
   */

  mcxa1xx_dmach_start(priv->rxdma, mcxa1xx_dma_rxcallback, (void *)priv);

  /* Clear DMA suspended flag. */

  priv->rxdmasusp  = false;
}
#endif

/****************************************************************************
 * Name: mcxa1xx_dma_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static void mcxa1xx_dma_rxint(struct uart_dev_s *dev, bool enable)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;

  /* Enable/disable DMA reception.
   *
   * Note that it is not safe to check for available bytes and immediately
   * pass them to uart_recvchars as that could potentially recurse back
   * to us again.  Instead, bytes must wait until the next up_dma_poll or
   * DMA event.
   */

  priv->rxenable = enable;
}
#endif

/****************************************************************************
 * Name: mcxa1xx_dma_rxavailable
 *
 * Description:
 *   Return true if the receive register is not empty
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static bool mcxa1xx_dma_rxavailable(struct uart_dev_s *dev)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;

  /* Compare our receive pointer to the current DMA pointer, if they
   * do not match, then there are bytes to be received.
   */

  return (mcxa1xx_dma_nextrx(priv) != priv->rxdmanext);
}
#endif

/****************************************************************************
 * Name: mcxa1xx_dma_txcallback
 *
 * Description:
 *   This function clears dma buffer at complete of DMA transfer and wakes up
 *   threads waiting for space in buffer.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_TXDMA
static void mcxa1xx_dma_txcallback(DMACH_HANDLE handle, void *arg, bool done,
                                  int result)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)arg;

  /* Update 'nbytes' indicating number of bytes actually transferred by DMA.
   * This is important to free TX buffer space by 'uart_xmitchars_done'.
   */

  priv->dev.dmatx.nbytes = priv->dev.dmatx.length;
#if CONFIG_MCXA1XX_EDMA_NTCD > 1
  priv->dev.dmatx.nbytes += priv->dev.dmatx.nlength;
#endif

  /* Adjust the pointers */

  uart_xmitchars_done(&priv->dev);

  /* Send more data if available */

  mcxa1xx_dma_txavailable(&priv->dev);
}
#endif

/****************************************************************************
 * Name: mcxa1xx_dma_txavailable
 *
 * Description:
 *        Informs DMA that Tx data is available and is ready for transfer.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_TXDMA
static void mcxa1xx_dma_txavailable(struct uart_dev_s *dev)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;

  /* Only send when the DMA is idle */

  if (mcxa1xx_dmach_idle(priv->txdma) == 0)
    {
      uart_xmitchars_dma(dev);
    }
}
#endif

/****************************************************************************
 * Name: mcxa1xx_dma_send
 *
 * Description:
 *   Called (usually) from the interrupt level to start DMA transfer.
 *   (Re-)Configures DMA Stream updating buffer and buffer length.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_TXDMA
static void mcxa1xx_dma_send(struct uart_dev_s *dev)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;
  struct mcxa1xx_edma_xfrconfig_s config;

  /* We need to stop DMA before reconfiguration */

  mcxa1xx_dmach_stop(priv->txdma);

  /* Reset the number sent */

  dev->dmatx.nbytes = 0;

  /* Make use of setup function to update buffer and its length for next
   * transfer
   */

  config.iter   = dev->dmatx.length;
  config.flags  = EDMA_CONFIG_LINKTYPE_LINKNONE;
  config.ssize  = EDMA_8BIT;
  config.dsize  = EDMA_8BIT;
  config.nbytes = 1;
  config.saddr  = (uintptr_t)dev->dmatx.buffer;
  config.daddr  = priv->uartbase + MCXA1XX_LPUART_DATA_OFFSET;
  config.soff   = 1;
  config.doff   = 0;
#ifdef CONFIG_MCXA1XX_EDMA_ELINK
  config.linkch  = 0;
#endif

  /* Flush the contents of the TX buffer into physical memory */

  up_clean_dcache((uintptr_t)dev->dmatx.buffer,
                  (uintptr_t)dev->dmatx.buffer + dev->dmatx.length);

  /* Setup first half */

  mcxa1xx_dmach_xfrsetup(priv->txdma, &config);

#if CONFIG_MCXA1XX_EDMA_NTCD > 1
  /* Is this a split transfer? */

  if (dev->dmatx.nbuffer)
    {
      config.iter   = priv->dev.dmatx.nlength;
      config.saddr  = (uintptr_t)priv->dev.dmatx.nbuffer;

      /* Flush the contents of the next TX buffer into physical memory */

      up_clean_dcache((uintptr_t)dev->dmatx.nbuffer,
                      (uintptr_t)dev->dmatx.nbuffer + dev->dmatx.nlength);

      mcxa1xx_dmach_xfrsetup(priv->txdma, &config);
    }
#endif

  /* Start transmission with the callback on DMA completion */

  mcxa1xx_dmach_start(priv->txdma, mcxa1xx_dma_txcallback, (void *)priv);
}
#endif

/****************************************************************************
 * Name: mcxa1xx_send
 *
 * Description:
 *   This method will send one byte on the UART
 *
 ****************************************************************************/

static void mcxa1xx_send(struct uart_dev_s *dev, int ch)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;

#ifdef CONSOLE_DEV
  if (dev == &CONSOLE_DEV.dev && !dev->isconsole)
    {
      return;
    }
#endif

  mcxa1xx_serialout(priv, MCXA1XX_LPUART_DATA_OFFSET, (uint32_t)ch);
}

/****************************************************************************
 * Name: mcxa1xx_dma_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts from the UART.
 *
 ****************************************************************************/

