agam-robotics/NuttX/arch/arm/src/mcxa1xx/mcxa1xx_lpuart.c
#ifdef SERIAL_HAVE_TXDMA
static void mcxa1xx_dma_txint(struct uart_dev_s *dev, bool enable)
{
  /* Nothing to do. */

  /* In case of DMA transfer we do not want to make use of UART interrupts.
   * Instead, we use DMA interrupts that are activated once during boot
   * sequence. Furthermore we can use mcxa1xx_dma_txcallback() to handle
   * stuff at half DMA transfer or after transfer completion (depending
   * on the configuration).
   */
}
#endif

/****************************************************************************
 * Name: mcxa1xx_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts
 *
 ****************************************************************************/

#if !defined(SERIAL_HAVE_ONLY_TXDMA)
static void mcxa1xx_txint(struct uart_dev_s *dev, bool enable)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;
  irqstate_t flags;
  uint32_t regval;

  /* Enable interrupt for TX complete */

  flags = spin_lock_irqsave(&priv->lock);
  if (enable)
    {
#ifndef CONFIG_SUPPRESS_SERIAL_INTS
      priv->ie |= LPUART_CTRL_TIE;
#endif
    }
  else
    {
      priv->ie &= ~LPUART_CTRL_TIE;
    }

  regval  = mcxa1xx_serialin(priv, MCXA1XX_LPUART_CTRL_OFFSET);
  regval &= ~LPUART_ALL_INTS;
  regval |= priv->ie;
  mcxa1xx_serialout(priv, MCXA1XX_LPUART_CTRL_OFFSET, regval);

#ifndef CONFIG_SUPPRESS_SERIAL_INTS
  if (enable)
    {
      uart_xmitchars(dev);
    }
#endif

  spin_unlock_irqrestore(&priv->lock, flags);
}
#endif

/****************************************************************************
 * Name: mcxa1xx_txready
 *
 * Description:
 *   Return true if the transmit fifo is available to be written to
 *
 ****************************************************************************/

static bool mcxa1xx_txready(struct uart_dev_s *dev)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;
  uint32_t regval;
  uint32_t fifo_size;
  uint32_t fifo_count;

  /* Read the fifo size and current fill ratio. Return true if fifo is not
   * full
   */

  regval = mcxa1xx_serialin(priv, MCXA1XX_LPUART_FIFO_OFFSET);
  fifo_size = (regval & LPUART_FIFO_TXFIFOSIZE_MASK) >>
    LPUART_FIFO_TXFIFOSIZE_SHIFT;
  fifo_size = fifo_size == 0 ? 1 : (1 << (fifo_size + 1));
  regval = mcxa1xx_serialin(priv, MCXA1XX_LPUART_WATER_OFFSET);
  fifo_count = (regval & LPUART_WATER_TXCOUNT_MASK) >>
    LPUART_WATER_TXCOUNT_SHIFT;

  return fifo_count < fifo_size;
}

/****************************************************************************
 * Name: mcxa1xx_txempty
 *
 * Description:
 *   Return true if the transmit fifo is empty
 *
 ****************************************************************************/

static bool mcxa1xx_txempty(struct uart_dev_s *dev)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)dev;
  uint32_t regval;

  regval = mcxa1xx_serialin(priv, MCXA1XX_LPUART_WATER_OFFSET);
  return (regval & LPUART_WATER_TXCOUNT_MASK) == 0;
}

/****************************************************************************
 * Name: mcxa1xx_dma_rxcallback
 *
 * Description:
 *   This function checks the current DMA state and calls the generic
 *   serial stack when bytes appear to be available.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static void mcxa1xx_dma_rxcallback(DMACH_HANDLE handle, void *arg, bool done,
                                  int result)
{
  struct mcxa1xx_uart_s *priv = (struct mcxa1xx_uart_s *)arg;
  uint32_t sr;

  if (priv->rxenable && mcxa1xx_dma_rxavailable(&priv->dev))
    {
      uart_recvchars(&priv->dev);
    }

  /* Get the masked LPUART status word to check and clear error flags.
   *
   * When wake-up from low power mode was not fast enough, UART is resumed
   * too late and sometimes exactly when character was coming over UART,
   * resulting to frame error.
   * If error flag is not cleared, Rx DMA will be stuck. Clearing errors
   * will release Rx DMA.
   */

  sr = mcxa1xx_serialin(priv, MCXA1XX_LPUART_STAT_OFFSET);

  if ((sr & (LPUART_STAT_OR | LPUART_STAT_NF | LPUART_STAT_FE)) != 0)
    {
      mcxa1xx_serialout(priv, MCXA1XX_LPUART_STAT_OFFSET,
                      sr & (LPUART_STAT_OR |
                            LPUART_STAT_NF |
                            LPUART_STAT_FE));
    }
}
#endif

/****************************************************************************
 * Name: up_pm_notify
 *
 * Description:
 *   Notify the driver of new power state. This callback is  called after
 *   all drivers have had the opprivunity to prepare for the new power state.
 *
 * Input Parameters:
 *
 *    cb - Returned to the driver. The driver version of the callback
 *         structure may include additional, driver-specific state data at
 *         the end of the structure.
 *
 *    pmstate - Identifies the new PM state
 *
 * Returned Value:
 *   None - The driver already agreed to transition to the low power
 *   consumption state when when it returned OK to the prepare() call.
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static void up_pm_notify(struct pm_callback_s *cb, int domain,
                         enum pm_state_e pmstate)
{
  switch (pmstate)
    {
      case (PM_NORMAL):
        {
          /* Logic for PM_NORMAL goes here */
        }
        break;

      case (PM_IDLE):
        {
          /* Logic for PM_IDLE goes here */
        }
        break;

      case (PM_STANDBY):
        {
          /* Logic for PM_STANDBY goes here */
        }
        break;

      case (PM_SLEEP):
        {
          /* Logic for PM_SLEEP goes here */
        }
        break;

      default:

        /* Should not get here */

        break;
    }
}
#endif

/****************************************************************************
 * Name: up_pm_prepare
 *
 * Description:
 *   Request the driver to prepare for a new power state. This is a warning
 *   that the system is about to enter into a new power state. The driver
 *   should begin whatever operations that may be required to enter power
 *   state. The driver may abort the state change mode by returning a
 *   non-zero value from the callback function.
 *
 * Input Parameters:
 *
 *    cb - Returned to the driver. The driver version of the callback
 *         structure may include additional, driver-specific state data at
 *         the end of the structure.
 *
 *    pmstate - Identifies the new PM state
 *
 * Returned Value:
 *   Zero - (OK) means the event was successfully processed and that the
 *          driver is prepared for the PM state change.
 *
 *   Non-zero - means that the driver is not prepared to perform the tasks
 *              needed achieve this power setting and will cause the state
 *              change to be aborted. NOTE: The prepare() method will also
 *              be called when reverting from lower back to higher power
 *              consumption modes (say because another driver refused a
 *              lower power state change). Drivers are not permitted to
 *              return non-zero values when reverting back to higher power
 *              consumption modes!
 *
 *
 ****************************************************************************/

